Revit 2022 API
ElectricalSystemSet.GetEnumerator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public virtual IEnumerator GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator
Visual C++
public:
virtual IEnumerator^ GetEnumerator()
Return Value
Returns a forward moving iterator to the set.
Implements
IEnumerable.GetEnumerator()
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace